Repository: TheXDS/Ganymede
Catalog: Extras/ProteusDemo/TestApp/Resources/Strings/Views/DialogDemoView.*.resx
Languages: es_mx

# HelpText
source: This page contains a few demos on how the dialog service works in Ganymede. Ganymede implements a dialog API that can be tailored to different platforms. For WPF apps, you have access to a custom dialog system that integrates well with the program's styling and interface. It follows a principle of keeping the number of independent windows down to one, and implements a consistent theme and style for all of them. As this dialog system is expandable, the dialog service included in Ganymede.Wpf can incorporate new dialogs without redefining the basic interface from scratch, instead it's just necessary to implement the actual dialog disticnt elements. You can see this while runnig through the different dialog demos here.
es_mx: Esta página contiene algunas demostraciones de cómo funciona el servicio de diálogos en Ganymede. Ganymede implementa una API de diálogos que puede orientarse a distintas plataformas. Para las aplicaciones WPF, usted tiene acceso a un sistema de diálogos personalizado que se integra bien con el estilo y la interfaz de este programa. Sigue un principio de mantener el número de ventanas independientes reducidas a una, e implementa un tema y un estilo consistentes para todos los diálogos. Como el sistema de diálogos es expandible, el servicio de diálogos incluído en Ganymede.Wpf puede incorporar nuevos diálogos sin tener que redefinir la interfaz de los mismos desde cero, siendo únicamente necesario definir e implementar lo que hace único a cada diálogo. Podrá observar esta afirmación con las distintas demostraciones aquí.

# Title
source: Dialog service demo
es_mx: Demostración de servicio de diálogo

# AskText
source: Is this dialog working correctly?
es_mx: ¿Funciona correctamente este cuadro de diálogo?

# CancellableOpTest
source: Test cancellable operation dialog
es_mx: Probar diálogo de operación cancelable

# ErrorTest
source: Test error message
es_mx: Probar mensaje de error

# ErrorText
source: This is an error message.
es_mx: Este es un mensaje de error.

source: Hello world!
es_mx: ¡Hola mundo!

source: Message
es_mx: Mensaje

# MessageTest
source: Test message
es_mx: Probar mensaje

# OperationTest
source: Test operation dialog
es_mx: Probar diálogo de operación

# QuestionTest
source: Test question
es_mx: Probar pregunta

# SelectItemTest
source: Test item selection
es_mx: Probar selección de elemento

source: Warning
es_mx: Advertencia

# WarningTest
source: Test warning message
es_mx: Probar mensaje de advertencia

# WarningText
source: This is a warning.
es_mx: Este es un mensaje de advertencia.

# TestTextInput
source: Text input
es_mx: Entrada de texto

# TextInputPrompt
source: Please enter some text here.
es_mx: Por favor, escriba algo de texto a continuación.

# CustomDialog1
source: Times ran
es_mx: Veces ejecutado

# OperationDemo1
source: Establishing connection...
es_mx: Estableciendo conexión...

# OperationDemo2
source: Writing to object {0}...
es_mx: Escribiendo a objeto {0}...

# OperationDemo3
source: Cleaning up...
es_mx: Limpiando...

# OperationDemo4
source: Cancelling...
es_mx: Cancelando...

# SelectDemo1
source: Option {0}
es_mx: Opción {0}

# SelectDemo2
source: Select option
es_mx: Seleccionar opción

# SelectDemo3
source: Select an option from the combo box below:
es_mx: Seleccione una opción desde el combo box a continuación:

# SelectDemo4
source: Nothing selected
es_mx: Nada seleccionado

# SelectDemo5
source: No option has been selected from the prompt.
es_mx: No se ha seleccionado ninguna opción en el diálogo.

# SelectDemo6
source: The user selected "{0}".
es_mx: El usuario ha seleccionado "{0}".

# TestCredentialInput
source: Credential input
es_mx: Entrada de credencial

# TestCustomDialog
source: User-defined dialog
es_mx: Diálogo definido por el usuario

# TestIntInput
source: Number input
es_mx: Entrada de número

# TestIntRangeInput
source: Number range input
es_mx: Entrada de rango de números

# TestWizard
source: Test wizard dialog
es_mx: Probar diálogo de asistente
